; *******************************************************
; 例 1 - 获取标题带有"AutoIt"的浏览器窗口, 并显示URL
; *******************************************************
;
#include <IE.au3>
$oIE = _IEAttach ("AutoIt")
MsgBox(0, "URL是", _IEPropertyGet ($oIE, "locationurl"))

; *******************************************************
; 例 2 - 获取顶层文件中带有"The quick brown fox"文本的浏览器窗口
; *******************************************************
;
#include <IE.au3>
$oIE = _IEAttach ("The quick brown fox", "text")

; *******************************************************
; 例 3 - 获取内嵌于一个窗口的浏览器控件
; *******************************************************
;
#include <IE.au3>
$oIE = _IEAttach ("A Window Title", "embedded")

; *******************************************************
; 例 4 - 获取内嵌于另一窗口的第三个浏览器控件; 使用高级窗口标题语法以使用标题中带有"ICQ"的第二个窗口
; *******************************************************
;
#include <IE.au3>
$oIE = _IEAttach ("[REGEXPTITLE:ICQ; INSTANCE:2]", "embedded", 3)

; *******************************************************
; 例 5 - 创建指向当前浏览器实例的对象数组; 首个元素包含找到的实例的数量
; *******************************************************
;
#include <IE.au3>

Dim $aIE[1]
$aIE[0] = 0

$i = 1
While 1
	$oIE = _IEAttach ("", "instance", $i)
	If @error = $_IEStatus_NoMatch Then ExitLoop
	ReDim $aIE[$i + 1]
	$aIE[$i] = $oIE
	$aIE[0] = $i
	$i += 1
WEnd

MsgBox(0, "已经找到浏览器", "数组里有: " & $aIE[0] & " 个浏览器的实例")
